OSabuser/tft_manufacture_test/bsp/board/pin_mux.h
/*
 * Copyright 2026 NXP
 * All rights reserved.
 * MU LLC 2026
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_SD_B1_03 (coord M4), UserLed1 */
/* Routed pin properties */
#define BOARD_INITPINS_UserLed1_PERIPHERAL                                 GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_UserLed1_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_UserLed1_CHANNEL                                       3U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_UserLed1_GPIO                                       GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_UserLed1_INIT_GPIO_VALUE                               1U   /*!< GPIO output initial state */
#define BOARD_INITPINS_UserLed1_GPIO_PIN                                      3U   /*!< GPIO pin number */
#define BOARD_INITPINS_UserLed1_GPIO_PIN_MASK                         (1U << 3U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_UserLed1_PORT                                       GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_UserLed1_PIN                                           3U   /*!< PORT pin number */
#define BOARD_INITPINS_UserLed1_PIN_MASK                              (1U << 3U)   /*!< PORT pin mask */

/* GPIO_SD_B1_04 (coord P2), UserLed2 */
/* Routed pin properties */
#define BOARD_INITPINS_UserLed2_PERIPHERAL                                 GPIO3   /*!< Peripheral name */
#define BOARD_INITPINS_UserLed2_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_UserLed2_CHANNEL                                       4U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_UserLed2_GPIO                                       GPIO3   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_UserLed2_INIT_GPIO_VALUE                               1U   /*!< GPIO output initial state */
#define BOARD_INITPINS_UserLed2_GPIO_PIN                                      4U   /*!< GPIO pin number */
#define BOARD_INITPINS_UserLed2_GPIO_PIN_MASK                         (1U << 4U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_UserLed2_PORT                                       GPIO3   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_UserLed2_PIN                                           4U   /*!< PORT pin number */
#define BOARD_INITPINS_UserLed2_PIN_MASK                              (1U << 4U)   /*!< PORT pin mask */

/* GPIO_AD_B1_03 (coord M12), SdPwr */
/* Routed pin properties */
#define BOARD_INITPINS_SdPwr_PERIPHERAL                                    GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_SdPwr_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_SdPwr_CHANNEL                                         19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_SdPwr_GPIO                                          GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_SdPwr_INIT_GPIO_VALUE                                  0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_SdPwr_GPIO_PIN                                        19U   /*!< GPIO pin number */
#define BOARD_INITPINS_SdPwr_GPIO_PIN_MASK                           (1U << 19U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_SdPwr_PORT                                          GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_SdPwr_PIN                                             19U   /*!< PORT pin number */
#define BOARD_INITPINS_SdPwr_PIN_MASK                                (1U << 19U)   /*!< PORT pin mask */

/* GPIO_AD_B1_04 (coord L12), LcdLed */
/* Routed pin properties */
#define BOARD_INITPINS_LcdLed_PERIPHERAL                                   GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_LcdLed_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LcdLed_CHANNEL                                        20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LcdLed_GPIO                                         GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LcdLed_INIT_GPIO_VALUE                                 0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_LcdLed_GPIO_PIN                                       20U   /*!< GPIO pin number */
#define BOARD_INITPINS_LcdLed_GPIO_PIN_MASK                          (1U << 20U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LcdLed_PORT                                         GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LcdLed_PIN                                            20U   /*!< PORT pin number */
#define BOARD_INITPINS_LcdLed_PIN_MASK                               (1U << 20U)   /*!< PORT pin mask */

/* GPIO_B1_14 (coord C14), TactBut1 */
/* Routed pin properties */
#define BOARD_INITPINS_TactBut1_PERIPHERAL                                 GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_TactBut1_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TactBut1_CHANNEL                                      30U   /*!< Signal channel */

