OSabuser/tft_manufacture_test/bsp/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TactBut1_GPIO                                       GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TactBut1_GPIO_PIN                                     30U   /*!< GPIO pin number */
#define BOARD_INITPINS_TactBut1_GPIO_PIN_MASK                        (1U << 30U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_TactBut1_PORT                                       GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_TactBut1_PIN                                          30U   /*!< PORT pin number */
#define BOARD_INITPINS_TactBut1_PIN_MASK                             (1U << 30U)   /*!< PORT pin mask */

/* GPIO_AD_B1_06 (coord J12), ExtIn1 */
/* Routed pin properties */
#define BOARD_INITPINS_ExtIn1_PERIPHERAL                                   GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_ExtIn1_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ExtIn1_CHANNEL                                        22U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ExtIn1_GPIO                                         GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ExtIn1_GPIO_PIN                                       22U   /*!< GPIO pin number */
#define BOARD_INITPINS_ExtIn1_GPIO_PIN_MASK                          (1U << 22U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ExtIn1_PORT                                         GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ExtIn1_PIN                                            22U   /*!< PORT pin number */
#define BOARD_INITPINS_ExtIn1_PIN_MASK                               (1U << 22U)   /*!< PORT pin mask */

/* GPIO_AD_B1_05 (coord K12), ExtIn2 */
/* Routed pin properties */
#define BOARD_INITPINS_ExtIn2_PERIPHERAL                                   GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_ExtIn2_SIGNAL                                     gpio_io   /*!< Signal name */
#define BOARD_INITPINS_ExtIn2_CHANNEL                                        21U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_ExtIn2_GPIO                                         GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_ExtIn2_GPIO_PIN                                       21U   /*!< GPIO pin number */
#define BOARD_INITPINS_ExtIn2_GPIO_PIN_MASK                          (1U << 21U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_ExtIn2_PORT                                         GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_ExtIn2_PIN                                            21U   /*!< PORT pin number */
#define BOARD_INITPINS_ExtIn2_PIN_MASK                               (1U << 21U)   /*!< PORT pin mask */

/* GPIO_AD_B1_08 (coord H13), VolumeControl */
/* Routed pin properties */
#define BOARD_INITPINS_VolumeControl_PERIPHERAL                             PWM4   /*!< Peripheral name */
#define BOARD_INITPINS_VolumeControl_SIGNAL                                    A   /*!< Signal name */
#define BOARD_INITPINS_VolumeControl_CHANNEL                                  0U   /*!< Signal channel */

/* GPIO_AD_B1_12 (coord H12), LcdLR */
/* Routed pin properties */
#define BOARD_INITPINS_LcdLr_PERIPHERAL                                    GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_LcdLr_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LcdLr_CHANNEL                                         28U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LcdLr_GPIO                                          GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LcdLr_INIT_GPIO_VALUE                                  0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_LcdLr_GPIO_PIN                                        28U   /*!< GPIO pin number */
#define BOARD_INITPINS_LcdLr_GPIO_PIN_MASK                           (1U << 28U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LcdLr_PORT                                          GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LcdLr_PIN                                             28U   /*!< PORT pin number */
#define BOARD_INITPINS_LcdLr_PIN_MASK                                (1U << 28U)   /*!< PORT pin mask */

/* GPIO_AD_B1_13 (coord H11), LcdMode */
/* Routed pin properties */
#define BOARD_INITPINS_LcdMode_PERIPHERAL                                  GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_LcdMode_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LcdMode_CHANNEL                                       29U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LcdMode_GPIO                                        GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LcdMode_INIT_GPIO_VALUE                                0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_LcdMode_GPIO_PIN                                      29U   /*!< GPIO pin number */
#define BOARD_INITPINS_LcdMode_GPIO_PIN_MASK                         (1U << 29U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LcdMode_PORT                                        GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LcdMode_PIN                                           29U   /*!< PORT pin number */
#define BOARD_INITPINS_LcdMode_PIN_MASK                              (1U << 29U)   /*!< PORT pin mask */

/* GPIO_AD_B1_14 (coord G12), Lc */
/* Routed pin properties */
#define BOARD_INITPINS_LcdUd_PERIPHERAL                                    GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_LcdUd_SIGNAL                                      gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LcdUd_CHANNEL                                         30U   /*!< Signal channel */

