OSabuser/tft_manufacture_test/bsp/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LcdUd_GPIO                                          GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LcdUd_INIT_GPIO_VALUE                                  0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_LcdUd_GPIO_PIN                                        30U   /*!< GPIO pin number */
#define BOARD_INITPINS_LcdUd_GPIO_PIN_MASK                           (1U << 30U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LcdUd_PORT                                          GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LcdUd_PIN                                             30U   /*!< PORT pin number */
#define BOARD_INITPINS_LcdUd_PIN_MASK                                (1U << 30U)   /*!< PORT pin mask */

/* GPIO_AD_B1_15 (coord J14), LcdDithb */
/* Routed pin properties */
#define BOARD_INITPINS_LcdDithb_PERIPHERAL                                 GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_LcdDithb_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LcdDithb_CHANNEL                                      31U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LcdDithb_GPIO                                       GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LcdDithb_INIT_GPIO_VALUE                               0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_LcdDithb_GPIO_PIN                                     31U   /*!< GPIO pin number */
#define BOARD_INITPINS_LcdDithb_GPIO_PIN_MASK                        (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LcdDithb_PORT                                       GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LcdDithb_PIN                                          31U   /*!< PORT pin number */
#define BOARD_INITPINS_LcdDithb_PIN_MASK                             (1U << 31U)   /*!< PORT pin mask */

/* GPIO_B1_15 (coord B14), TactBut2 */
/* Routed pin properties */
#define BOARD_INITPINS_TactBut2_PERIPHERAL                                 GPIO2   /*!< Peripheral name */
#define BOARD_INITPINS_TactBut2_SIGNAL                                   gpio_io   /*!< Signal name */
#define BOARD_INITPINS_TactBut2_CHANNEL                                      31U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_TactBut2_GPIO                                       GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_TactBut2_GPIO_PIN                                     31U   /*!< GPIO pin number */
#define BOARD_INITPINS_TactBut2_GPIO_PIN_MASK                        (1U << 31U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_TactBut2_PORT                                       GPIO2   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_TactBut2_PIN                                          31U   /*!< PORT pin number */
#define BOARD_INITPINS_TactBut2_PIN_MASK                             (1U << 31U)   /*!< PORT pin mask */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_AD_B1_07 (coord K10), RsRx */
/* Routed pin properties */
#define BOARD_INITRS_UART_RsRx_PERIPHERAL                                LPUART3   /*!< Peripheral name */
#define BOARD_INITRS_UART_RsRx_SIGNAL                                         RX   /*!< Signal name */


/*!
 * @brief RS_RX pin is used as LPUART3_RX
 *
 */
void BOARD_InitRS_UART(void);

/* GPIO_AD_B1_07 (coord K10), RsRx */
/* Routed pin properties */
#define BOARD_INITRS_UART_DEINIT_RsRx_PERIPHERAL                           GPIO1   /*!< Peripheral name */
#define BOARD_INITRS_UART_DEINIT_RsRx_SIGNAL                             gpio_io   /*!< Signal name */
#define BOARD_INITRS_UART_DEINIT_RsRx_CHANNEL                                23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITRS_UART_DEINIT_RsRx_GPIO                                 GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITRS_UART_DEINIT_RsRx_GPIO_PIN                               23U   /*!< GPIO pin number */
#define BOARD_INITRS_UART_DEINIT_RsRx_GPIO_PIN_MASK                  (1U << 23U)   /*!< GPIO pin mask */
#define BOARD_INITRS_UART_DEINIT_RsRx_PORT                                 GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITRS_UART_DEINIT_RsRx_PIN                                    23U   /*!< PORT pin number */
#define BOARD_INITRS_UART_DEINIT_RsRx_PIN_MASK                       (1U << 23U)   /*!< PORT pin mask */

/* GPIO_AD_B1_07 (coord K10), RsRx */
/* Routed pin properties */
#define BOARD_INITRS_UART_DEINIT_RsRx_PERIPHERAL                            ADC2   /*!< Peripheral name */
#define BOARD_INITRS_UART_DEINIT_RsRx_SIGNAL                                  IN   /*!< Signal name */
#define BOARD_INITRS_UART_DEINIT_RsRx_CHANNEL                                12U   /*!< Signal channel */

/* GPIO_AD_B1_07 (coord K10), RsRx */
/* Routed pin properties */
#define BOARD_INITRS_UART_DEINIT_RsRx_PERIPHERAL                            CMP1   /*!< Peripheral name */
#define BOARD_INITRS_UART_DEINIT_RsRx_SIGNAL                                  IN   /*!< Signal name */
#define BOARD_INITRS_UART_DEINIT_RsRx_CHANNEL                                 5U   /*!< Signal channel */

/* GPIO_AD_B1_07 (coord K10) */
/* Routed pin properties */
#define BOARD_INITRS_UART_DEINIT_RsRx_PERIPHERAL                            ADC1   /*!< Peripheral name */
#define BOARD_INITRS_UART_DEINIT_RsRx_SIGNAL                                  IN   /*!< Signal name */
#define BOARD_INITRS_UART_DEINIT_RsRx_CHANNEL                                12U   /*!< Signal channel */


/*!
 * @brief This is a de-initialization function for 'BOARD_InitRS_UART' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void BOARD_InitRS_UART_deinit(void);

/* GPIO_AD_B1_07 (coord K10), RsRx */
/* Routed pin properties */
#define BOARD_INITRS_GPIO_RsRx_PERIPHERAL                                  GPIO1   /*!< Peripheral name */
#define BOARD_INITRS_GPIO_RsRx_SIGNAL                                    gpio_io   /*!< Signal name */
#define BOARD_INITRS_GPIO_RsRx_CHANNEL                                       23U   /*!< Signal channel */

