OSabuser/tft_manufacture_test/bsp/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITRS_GPIO_RsRx_GPIO                                        GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITRS_GPIO_RsRx_GPIO_PIN                                      23U   /*!< GPIO pin number */
#define BOARD_INITRS_GPIO_RsRx_GPIO_PIN_MASK                         (1U << 23U)   /*!< GPIO pin mask */
#define BOARD_INITRS_GPIO_RsRx_PORT                                        GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITRS_GPIO_RsRx_PIN                                           23U   /*!< PORT pin number */
#define BOARD_INITRS_GPIO_RsRx_PIN_MASK                              (1U << 23U)   /*!< PORT pin mask */


/*!
 * @brief RS_RX pin is used as GPIO_INPUT
 *
 */
void BOARD_InitRS_GPIO(void);

/* GPIO_AD_B1_07 (coord K10), RsRx */
/* Routed pin properties */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_PERIPHERAL                           GPIO1   /*!< Peripheral name */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_SIGNAL                             gpio_io   /*!< Signal name */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_CHANNEL                                23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_GPIO                                 GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_GPIO_PIN                               23U   /*!< GPIO pin number */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_GPIO_PIN_MASK                  (1U << 23U)   /*!< GPIO pin mask */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_PORT                                 GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_PIN                                    23U   /*!< PORT pin number */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_PIN_MASK                       (1U << 23U)   /*!< PORT pin mask */

/* GPIO_AD_B1_07 (coord K10), RsRx */
/* Routed pin properties */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_PERIPHERAL                            ADC2   /*!< Peripheral name */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_SIGNAL                                  IN   /*!< Signal name */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_CHANNEL                                12U   /*!< Signal channel */

/* GPIO_AD_B1_07 (coord K10), RsRx */
/* Routed pin properties */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_PERIPHERAL                            CMP1   /*!< Peripheral name */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_SIGNAL                                  IN   /*!< Signal name */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_CHANNEL                                 5U   /*!< Signal channel */

/* GPIO_AD_B1_07 (coord K10) */
/* Routed pin properties */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_PERIPHERAL                            ADC1   /*!< Peripheral name */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_SIGNAL                                  IN   /*!< Signal name */
#define BOARD_INITRS_GPIO_DEINIT_RsRx_CHANNEL                                12U   /*!< Signal channel */


/*!
 * @brief This is a de-initialization function for 'BOARD_InitRS_GPIO' function.
 * It sets all pins features (routing, direction and electrical) to their after-reset state.
 * It also tries to route the previous peripheral signals to their default pins.
 *
 */
void BOARD_InitRS_GPIO_deinit(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
